analysis_runs/tuned_20260629_2319/benchmarks/results/spec_bf16_n1_c24.txt
INFO 06-29 23:27:46 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 06-29 23:27:46 [nixl_utils.py:34] NIXL is not available
WARNING 06-29 23:27:46 [nixl_utils.py:44] NIXL agent config is not available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7123073684a0>, trust_remote_code=False, seed=0, num_prompts=480, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=24, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/niko/neb/spec_dec/analysis_runs/tuned_20260629_2319/benchmarks/results', result_filename='spec_bf16_n1_c24.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-2602b4ad-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-29 23:27:51 [datasets.py:307] Oversampled requests to reach 480 total samples.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 24
100%|██████████| 480/480 [00:31<00:00, 15.11it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     480       
Failed requests:                         0         
Maximum request concurrency:             24        
Benchmark duration (s):                  31.77     
Total input tokens:                      38471     
Total generated tokens:                  122880    
Request throughput (req/s):              15.11     
Output token throughput (tok/s):         3867.77   
Peak output token throughput (tok/s):    3000.00   
Peak concurrent requests:                48.00     
Total token throughput (tok/s):          5078.68   
---------------Time to First Token----------------
Mean TTFT (ms):                          29.08     
Median TTFT (ms):                        24.36     
P99 TTFT (ms):                           91.53     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.00      
Median TPOT (ms):                        6.03      
P99 TPOT (ms):                           6.62      
---------------Inter-token Latency----------------
Mean ITL (ms):                           8.12      
Median ITL (ms):                         8.02      
P99 ITL (ms):                            16.57     
---------------Speculative Decoding---------------
Acceptance rate (%):                     35.28     
Acceptance length:                       1.35      
Drafts:                                  90568     
Draft tokens:                            90568     
Accepted tokens:                         31950     
Per-position acceptance (%):
  Position 0:                            35.28     
==================================================